<a href="https://colab.research.google.com/github/lyeslehara1996/Colab/blob/main/TweeterSentiments.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
import re 
import nltk
from nltk.tokenize import TweetTokenizer
from nltk import FreqDist
import string

In [3]:
df=pd.read_excel('/content/SemEval2017.xlsx')
df.head()

                   id   polariy  ... Unnamed: 14  Unnamed: 15
0  619950566786113024   neutral  ...         NaN          NaN
1  619969366986235008   neutral  ...         NaN          NaN
2  619971047195044992  negative  ...         NaN          NaN
3  619974445185302016   neutral  ...         NaN          NaN
4  619987808317406976  positive  ...         NaN          NaN

[5 rows x 16 columns]

In [4]:
df.drop("polariy", axis=1, inplace=True)

In [5]:
df.drop("Unnamed: 3", axis=1, inplace=True)
df.drop("Unnamed: 4", axis=1, inplace=True)
df.drop("Unnamed: 5", axis=1, inplace=True)
df.drop("Unnamed: 6", axis=1, inplace=True)
df.drop("Unnamed: 7", axis=1, inplace=True)
df.drop("Unnamed: 8", axis=1, inplace=True)
df.drop("Unnamed: 9", axis=1, inplace=True)
df.drop("Unnamed: 10", axis=1, inplace=True)
df.drop("Unnamed: 11", axis=1, inplace=True)
df.drop("Unnamed: 12", axis=1, inplace=True)
df.drop("Unnamed: 13", axis=1, inplace=True)
df.drop("Unnamed: 14", axis=1, inplace=True)
df.drop("Unnamed: 15", axis=1, inplace=True)

In [6]:
df.head()

                   id                                           Comments
0  619950566786113024  Picturehouse's, Pink Floyd's, 'Roger Waters: T...
1  619969366986235008  Order Go Set a Watchman in store or through ou...
2  619971047195044992  If these runway renovations at the airport pre...
3  619974445185302016  If you could ask an onstage interview question...
4  619987808317406976  A portion of book sales from our Harper Lee/Go...

In [7]:
df_clean = df

In [8]:
df_clean.head()

                   id                                           Comments
0  619950566786113024  Picturehouse's, Pink Floyd's, 'Roger Waters: T...
1  619969366986235008  Order Go Set a Watchman in store or through ou...
2  619971047195044992  If these runway renovations at the airport pre...
3  619974445185302016  If you could ask an onstage interview question...
4  619987808317406976  A portion of book sales from our Harper Lee/Go...

In [10]:
df_clean.Comments=df_clean.Comments.str.lower()
df_clean.head()

                   id                                           Comments
0  619950566786113024  picturehouse's, pink floyd's, 'roger waters: t...
1  619969366986235008  order go set a watchman in store or through ou...
2  619971047195044992  if these runway renovations at the airport pre...
3  619974445185302016  if you could ask an onstage interview question...
4  619987808317406976  a portion of book sales from our harper lee/go...

In [11]:
print(df_clean)

                       id                                           Comments
0      619950566786113024  picturehouse's, pink floyd's, 'roger waters: t...
1      619969366986235008  order go set a watchman in store or through ou...
2      619971047195044992  if these runway renovations at the airport pre...
3      619974445185302016  if you could ask an onstage interview question...
4      619987808317406976  a portion of book sales from our harper lee/go...
...                   ...                                                ...
20628  681877834982232064  @shaquillehoneal from what i think you're aski...
20629  681879579129200000  iran ranks 1st in liver surgeries, allah bless...
20630  681883903259357056  hours before he arrived in saudi arabia on tue...
20631  681904976860327040  @vanityfair  alex kim kardashian worth how to ...
20632  681910549211287040  i guess even pandora knows justin bieber is a ...

[20633 rows x 2 columns]

In [40]:
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r'https?:\/\/\S+', ' ', str(x)))
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r"www\.[a-z]?\.?(com)+|[a-z]+\.(com)", ' ', str(x)))

In [41]:
df_clean.head()

                   id                                           Comments
0  619950566786113024  picturehouse's  pink floyd's  'roger waters: t...
1  619969366986235008  order go set a watchman in store or through ou...
2  619971047195044992  if these runway renovations at the airport pre...
3  619974445185302016  if you could ask an onstage interview question...
4  619987808317406976  a portion of book sales from our harper lee/go...

In [42]:
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r'{link}', ' ', str(x)))

In [43]:
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r'&[a-z]+;', ' ', str(x)))

In [47]:
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r"[^a-z]", ' ', str(x)))

In [48]:
df_clean.Comments = df_clean.Comments.apply(lambda x: re.sub(r'@mention', ' ', x))

In [51]:
df_clean.Comments = df_clean.Comments.apply(lambda x: " ".join(x.lower() for x in str(x).split()  if len(x)>3 ))

In [52]:
print(df_clean)

                       id                                           Comments
0      619950566786113024  picturehouse pink floyd roger waters walll ope...
1      619969366986235008  order watchman store through website before tu...
2      619971047195044992  these runway renovations airport prevent from ...
3      619974445185302016  could onstage interview question miss tomorrow...
4      619987808317406976  portion book sales from harper watchman releas...
...                   ...                                                ...
20628  681877834982232064  shaquillehoneal from what think asking order f...
20629  681879579129200000     iran ranks liver surgeries allah bless country
20630  681883903259357056  hours before arrived saudi arabia tuesday turk...
20631  681904976860327040  vanityfair alex kardashian worth love kardashi...
20632  681910549211287040  guess even pandora knows justin bieber grown t...

[20633 rows x 2 columns]

In [54]:
from nltk.tokenize import TweetTokenizer
tknzr = TweetTokenizer()
df_clean['Clean_Comment'] = df_clean['Comments'].apply(tknzr.tokenize)
df_clean.head()

                   id  ...                                      Clean_Comment
0  619950566786113024  ...  [picturehouse, pink, floyd, roger, waters, wal...
1  619969366986235008  ...  [order, watchman, store, through, website, bef...
2  619971047195044992  ...  [these, runway, renovations, airport, prevent,...
3  619974445185302016  ...  [could, onstage, interview, question, miss, to...
4  619987808317406976  ...  [portion, book, sales, from, harper, watchman,...

[5 rows x 3 columns]

In [56]:
from nltk.stem.porter import PorterStemmer
stemmer=PorterStemmer()
df_clean['Clean_Comment']=df_clean['Clean_Comment'].apply(lambda sentence: [stemmer.stem(word) for word in sentence ])
df_clean.head()

                   id  ...                                      Clean_Comment
0  619950566786113024  ...  [pictureh, pink, floyd, roger, water, walll, o...
1  619969366986235008  ...  [order, watchman, store, through, websit, befo...
2  619971047195044992  ...  [these, runway, renov, airport, prevent, from,...
3  619974445185302016  ...  [could, onstag, interview, question, miss, tom...
4  619987808317406976  ...  [portion, book, sale, from, harper, watchman, ...

[5 rows x 3 columns]